      *> AUTHOR: Gideon
      *> DATE: July 01, 2026
      *> PURPOSE: My first COBOL program - display greetings

       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASSIGNMENT2.

       PROCEDURE DIVISION.
           DISPLAY "Welcome to FAC Academy COBOL!".
           DISPLAY "I am learning COBOL.".
      *> Program ends here
           STOP RUN.
